# WallAverageHeight

## Description
Returns the average height of walls, including wall peaks and different starting and ending heights.

```pascal
FUNCTION WallAverageHeight(c : CRITERIA) : REAL;
```

```python

def vs.WallAverageHeight(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from VectorWorks12.0
## Category
* Criteria